Revit 2027 API
DefinitionBindingMap.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	Definition key,
	Binding item
)
Public Overridable Function Insert (
	key As Definition,
	item As Binding
) As Boolean
public:
virtual bool Insert(
	Definition^ key,
	Binding^ item
)
abstract Insert :
        key : Definition *
        item : Binding -> bool
override Insert :
        key : Definition *
        item : Binding -> bool
Parameters
key Definition
item Binding
Return Value
Boolean
See Also
Reference
DefinitionBindingMap Class
Autodesk.Revit.DB Namespace